Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
data = [4, 8, 15, 16, 23,42]

In [2]:
import pandas as pd

In [3]:
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
data1 = [i**2 for i in range(1,11)]
pd.Series(data1)

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
    
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

In [15]:
data3 = [["Name","Age","Gender"],
        ["Alice","BOB","Claire"],
        [25,30,27],
        ["Female","Male","Female"]]

In [23]:
data4 = pd.DataFrame(data3)
data4

        0     1       2
0    Name   Age  Gender
1   Alice   BOB  Claire
2      25    30      27
3  Female  Male  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

In [24]:
#this is dataframe
data4

        0     1       2
0    Name   Age  Gender
1   Alice   BOB  Claire
2      25    30      27
3  Female  Male  Female

In [32]:
#series
data4[0]

0      Name
1     Alice
2        25
3    Female
Name: 0, dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

some common functions are :
    1: read_csv()
    
    2: head()

    3: describe()
    
    4: memory_usage()
    
    5: astype()

In [37]:
data4.memory_usage()

Index    128
0         32
1         32
2         32
dtype: int64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?


Both Series and DataFrame are mutable in nature, while Panel is now deprecated in the latest version of Pandas, and its functionalities are replaced by other data structures like MultiIndex and Panel4D.

In Pandas, the term mutable refers to the ability to modify the data elements of an object after it has been created. Both Series and DataFrame objects can be modified after creation by adding, deleting, or updating rows or columns. However, the object's index and column labels can also be modified, which makes them mutable in nature.

For instance, to modify a DataFrame's column, we can use the following syntax:

python



df['column_name'] = new_values


Similarly, to modify a Series, we can use the following syntax:

python



series_name[index] = new_value


However, it is essential to note that some operations, such as reindexing, can create a new object instead of modifying the existing one.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In Pandas, we can create a DataFrame using multiple Series. Here is an example of how to create a DataFrame using two Series:

In [42]:
import pandas as pd

# create first series
names = pd.Series(['John', 'Bob', 'Alice'])

# create second series
ages = pd.Series([30, 25, 35])

#create third series

gender = pd.Series(["Male","Male","Female"])

# create a DataFrame using the two series
df = pd.DataFrame({'Name': names, 'Age': ages})

# display the DataFrame
df

    Name  Age
0   John   30
1    Bob   25
2  Alice   35